In [2]:
import sqlite3
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
connection = sqlite3.connect('my_database2.db')
%load_ext sql
%sql sqlite:///my_database2.db

In [5]:
# %%sql 
# SELECT name, quantity
# FROM Store INNER JOIN Product ON Store.ID_Product = Product.id 
# WHERE quantity = (SELECT MAX(quantity) FROM Store)

 * sqlite:///my_database2.db
Done.

[('Зонтик', 200), ('Фотоаппарат', 200)]

In [14]:
# %%sql
# SELECT (SELECT name FROM Product WHERE Product.id = Store.ID_Product) as name, quantity FROM Store
# WHERE quantity = (SELECT max(quantity) FROM Store)

# SELECT Name 
#     FROM Product 
#     WHERE id IN (
#         SELECT ID_Product
#             FROM Store

 * sqlite:///my_database2.db
Done.

[('Зонтик', 200), ('Фотоаппарат', 200)]

In [7]:
# 1) Вывести наименования товаров, количество которых на складе максимально (на
# складе должно быть как минимум два товара, количество которых одинаково и
# равно максимальному).

In [8]:
%%sql
SELECT name 
FROM Product 
WHERE id in (
    SELECT ID_Product 
    FROM Store 
    WHERE quantity = (SELECT max(quantity) FROM Store)
)

 * sqlite:///my_database2.db
Done.

[('Зонтик',), ('Фотоаппарат',)]

In [3]:
# %%sql
# SELECT name, quantity
# FROM Store INNER JOIN Product ON Store.ID_Product = Product.id
# WHERE quantity BETWEEN 100 AND 150
# ORDER BY name DESC

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100),
 ('Футбольный мяч', 150),
 ('Наушники', 100),
 ('Книга', 150)]

In [21]:
# %%sql
# SELECT (SELECT name FROM Product WHERE Product.id = Store.ID_Product) as name, quantity 
# FROM Store
# WHERE quantity BETWEEN 100 AND 150
# ORDER BY name DESC

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 100),
 ('Футбольный мяч', 150),
 ('Наушники', 100),
 ('Книга', 150)]

In [ ]:
# 2) Вывести в порядке, обратном алфавитному, наименования товаров, количество
# которых на складе находится в заданном диапазоне

In [9]:
%%sql
SELECT name 
FROM Product
WHERE id IN (
    SELECT ID_Product 
    FROM Store
    GROUP BY ID_Product
    HAVING SUM(quantity) BETWEEN 100 AND 150
)

 * sqlite:///my_database2.db
Done.

[('Ноутбук',), ('Наушники',), ('Книга',)]

In [27]:
# %%sql
# SELECT DISTINCT name
# FROM Store INNER JOIN Provider ON Store.ID_Provider = Provider.id
# ORDER BY name

 * sqlite:///my_database2.db
Done.

[('Компания A',), ('Компания B',), ('Компания C',)]

In [25]:
# %%sql
# SELECT DISTINCT (SELECT name FROM Provider WHERE Provider.id = ID_Provider) as name 
# FROM Store
# ORDER BY name

 * sqlite:///my_database2.db
Done.

[('Компания A',), ('Компания B',), ('Компания C',)]

In [ ]:
# 3)Вывести поставщиков, которые хотя бы раз осуществили поставку, в алфавитном
# порядке

In [10]:
%%sql
SELECT name
FROM Provider
WHERE id in (
    SELECT DISTINCT ID_Provider 
    FROM Store
)

 * sqlite:///my_database2.db
Done.

[('Компания A',), ('Компания B',), ('Компания C',)]

In [19]:
# %%sql 
# SELECT DISTINCT julianday(Date("now")) - julianday(date) AS diff, name 
# FROM Deal INNER JOIN Client ON Deal.ID_Client = Client.id
# WHERE diff<=30

 * sqlite:///my_database2.db
Done.

[(26.0, 'Петров Дмитрий'),
 (21.0, 'Кузнецова Анна'),
 (20.0, 'Жуков Игорь'),
 (18.0, 'Морозова Наталья')]

In [45]:
# %%sql
# SELECT DISTINCT (SELECT name FROM Client WHERE ID_Client = id) as name
# FROM Deal
# WHERE julianday(Date("now")) - julianday(date) < 60
# ORDER BY date DESC

 * sqlite:///my_database2.db
Done.

[('Иванов Петр',),
 ('Морозова Наталья',),
 ('Кузнецова Анна',),
 ('Петров Дмитрий',),
 ('Сергеева Ольга',)]

In [ ]:
# 4). 30 дней с даты последней покупки действует дополнительная скидка на все товары.
# Вывести список покупателей, имеющих возможность воспользоваться указанной
# скидкой.

In [11]:
%%sql
SELECT name 
FROM Client
WHERE id IN (
    SELECT DISTINCT ID_Client 
    FROM DEAL
    WHERE julianday(Date("now")) - julianday(date) < 70
)

 * sqlite:///my_database2.db
Done.

[('Иванов Петр',),
 ('Сергеева Ольга',),
 ('Петров Дмитрий',),
 ('Кузнецова Анна',),
 ('Морозова Наталья',)]

In [31]:
# %%sql 
# SELECT name, price
# FROM Product INNER JOIN Store ON Product.id = Store.ID_Product
# WHERE (name LIKE "Ф%" OR name LIKE "Н%") AND price < (SELECT MAX(price) FROM Store) * 0.2

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч', 50), ('Футбольный мяч', 55), ('Наушники', 100)]

In [51]:
# %%sql
# SELECT (SELECT name FROM Product WHERE id = ID_Product) as name 
# FROM Store
# WHERE (name LIKE "Ф%" OR name LIKE "Н%") AND price < (SELECT MAX(price) FROM Store) * 0.2

 * sqlite:///my_database2.db
Done.

[('Футбольный мяч',), ('Футбольный мяч',), ('Наушники',)]

In [ ]:
# 5) Вывести список товаров, названия которых начинающиеся с букв «д» и «л»,
# стоимость которых не более 20% от максимальной

In [4]:
%%sql
SELECT name 
FROM Product 
WHERE id IN (
    SELECT ID_Product
    FROM Store
    WHERE price <= (SELECT MAX(price) FROM Store) * 0.2
) AND name LIKE "[Д]%"

 * sqlite:///my_database2.db
Done.

[]

In [41]:
# %%sql 
# SELECT DISTINCT Provider.name
# FROM Store 
# INNER JOIN Provider ON Store.ID_Provider = Provider.id
# INNER JOIN Product ON Store.ID_Product = Product.id
# WHERE Product.name NOT LIKE 'З%' AND Product.name NOT LIKE 'С%'

 * sqlite:///my_database2.db
Done.

[('Компания A',), ('Компания B',), ('Компания C',)]

In [94]:
# %%sql
# SELECT DISTINCT (SELECT name FROM Provider WHERE id = ID_Provider) as name
# FROM Store
# WHERE ID_Provider NOT IN (
#     SELECT ID_Provider
#     FROM Store 
#     WHERE (SELECT name FROM Product WHERE id = ID_Product) LIKE 'Фу%'
#     )

 * sqlite:///my_database2.db
Done.

[('Компания C',)]

In [ ]:
# 6) Вывести поставщиков, которые не поставляют товары, названия которых
# начинающиеся с букв «д» и «л».

In [13]:
%%sql
SELECT DISTINCT name 
FROM Provider
WHERE id NOT IN (
    SELECT ID_Provider 
    FROM Store
    WHERE ID_Product IN (
        SELECT id
        FROM Product 
        WHERE name LIKE "Фу%" OR name LIKE "Фе%"
    )
)

 * sqlite:///my_database2.db
Done.

[('Компания C',), ('ИП Иванов И.И.',), ('ИП Петров П.П.',)]

In [14]:
%%sql
SELECT name, sex FROM Client

 * sqlite:///my_database2.db
Done.

[('Иванов Петр', 'м'),
 ('Смирнова Елена', 'ж'),
 ('Козлов Александр', 'м'),
 ('Попова Марина', 'ж'),
 ('Николаев Андрей', 'м'),
 ('Сергеева Ольга', 'ж'),
 ('Петров Дмитрий', 'м'),
 ('Кузнецова Анна', 'ж'),
 ('Жуков Игорь', 'м'),
 ('Морозова Наталья', 'ж'),
 ('Вованов Петр', 'м'),
 ('|ованов Петр', 'м')]

In [5]:
%%sql
SELECT 
    name,
    CASE 
        WHEN sex = 'ж' THEN 'женщина'
        WHEN sex = 'м' THEN 'мужчина'
        ELSE 'не указан'
    END AS sex_name
FROM Client;

 * sqlite:///my_database2.db
Done.

[('Иванов Петр', 'мужчина'),
 ('Смирнова Елена', 'женщина'),
 ('Козлов Александр', 'мужчина'),
 ('Попова Марина', 'женщина'),
 ('Николаев Андрей', 'мужчина'),
 ('Сергеева Ольга', 'женщина'),
 ('Петров Дмитрий', 'мужчина'),
 ('Кузнецова Анна', 'женщина'),
 ('Жуков Игорь', 'мужчина'),
 ('Морозова Наталья', 'женщина'),
 ('Вованов Петр', 'мужчина'),
 ('|ованов Петр', 'мужчина')]